app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    # Méthode qui récupère tous les photos et les envoie à la view index (index.html.erb) pour affichage
    @items = Item.all
    puts "$" * 60
    puts "Voici le nombre de photos dans la base : #{@items.length}"

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_item
    item_id = params[:id].to_i
    puts "$" * 60
    puts "item_id : #{item_id}"
    @item = Item.find_by(id: item_id)