app/controllers/users_controller.rb

  def get_user
    user_id = params[:id].to_i
    puts "$" * 60
    puts "user_id : #{user_id}"
    @user = User.find_by(id: user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]